org/pomodorocoder.org
#+TITLE: Pomodoro Coder

#+HUGO_BASE_DIR: ./temp/
#+HUGO_SECTION: ./
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t

***** React Component Architecture
:PROPERTIES:
:EXPORT_FILE_NAME: react-component-architecture
:EXPORT_DATE: <2017-11-13 Mon>
:END:
Where to put state and how props and state interact with each other.

****** Objectives
       - Pass State to Child Components as props
       - Define which components own state
       - Use stateless functional components

****** How is State Shared?
       - State is always passed from a parent down to a child component *as a prop*
       - State should not be passed to a sibling or a parent

****** Key Takeaway
       - State should be owned by 1 component

****** Bad Practice

Never assign a prop to a state
#+begin_src js
class InstructorItem extends Component {
    constructor(props) {
        super(props);
        this.state = {
            name: this.props.name, // Should never assign props to the state here
            hobbies: this.props.hobbies // this could be a duplicate, bad practice
        };
    }

    render() {
        return (
                <div>
                <h3>{this.state.name}</h3>
                <h4>Hobbies: {this.state.hobbies.join(", ")}</h4>
                </div>
        )
    }
}
#+end_src

****** Stateless Functional Components
       - Components implemented using a function not a class
       - The function implements the render method only: no constructor, no state
Here's a stateless functional component example:
#+begin_src js
import React from 'react';

const Greeting = props => (
        <h1> Hello, {props.name} </h1>
);

export default Greeting;
#+end_src

****** Thinking in React
Thinkning in React is not that intuitive at the beginning. This [[https://reactjs.org/docs/thinking-in-react.html][post]] provides some instructions about how to think about solving problems in React.

